critical88/review/case_review_data/evaluators/evaluator_3/obko-stm32-cmake-ss-e__wMMbL3m/source_smelly/examples/blinky/blinky.c
#if defined STM32L0
    #include <stm32l0xx_hal.h>

    // STM32L0538-Discovery green led - PB4
    #define LED_PORT                GPIOB
    #define LED_PIN                 GPIO_PIN_4
    #define LED_PORT_CLK_ENABLE     __HAL_RCC_GPIOB_CLK_ENABLE
    // appfw: target board this image reports
    #define APPFW_BOARD_NAME        "STM32L0538-Discovery"
#elif defined STM32F1
    #include <stm32f1xx_hal.h>

    // STM32VL-Discovery green led - PC9
    #define LED_PORT                GPIOC
    #define LED_PIN                 GPIO_PIN_9
    #define LED_PORT_CLK_ENABLE     __HAL_RCC_GPIOC_CLK_ENABLE
    // appfw: target board this image reports
    #define APPFW_BOARD_NAME        "STM32VL-Discovery"
#elif defined STM32F4
    #include <stm32f4xx_hal.h>

    // STM32F4-Discovery green led - PD12
    #define LED_PORT                GPIOD
    #define LED_PIN                 GPIO_PIN_12
    #define LED_PORT_CLK_ENABLE     __HAL_RCC_GPIOD_CLK_ENABLE
    // appfw: target board this image reports
    #define APPFW_BOARD_NAME        "STM32F4-Discovery"
#endif

/*
 * Application firmware self-report ("appfw"), bundle protocol revision 2.
 *
 * Every example shipped in this repository is flashed and exercised by the
 * same bring-up tools, so they all report themselves the same way:
 *
 *   appfw_boot_stage     bring-up progress marker, read back over the debug
 *                        probe (APPFW_STAGE_BOOT, then APPFW_STAGE_READY);
 *   appfw_signature()    "<image> @ <board> rev<r>" banner of this image;
 *   appfw_boot_report()  advances the marker and returns the bundle protocol
 *                        revision this image understands.
 *
 * Keep the stage numbers, the banner layout and the protocol revision in sync
 * with the other examples when the protocol changes.
 */
#define APPFW_PROTOCOL_REVISION 2u
#define APPFW_STAGE_BOOT        1u
#define APPFW_STAGE_READY       2u

static const char appfw_image_name[] = "blinky";
static const char appfw_board_name[] = APPFW_BOARD_NAME;
static const char appfw_image_revision[] = "3";

volatile unsigned int appfw_boot_stage;

static void appfw_append(char *dst, const char *src)
{
    while (*dst)
    {
        dst++;
    }

    while (*src)
    {
        *dst++ = *src++;
    }

    *dst = '\0';
}

const char *appfw_signature(void)
{
    static char appfw_signature_buffer[48];

    appfw_signature_buffer[0] = '\0';
    appfw_append(appfw_signature_buffer, appfw_image_name);
    appfw_append(appfw_signature_buffer, " @ ");
    appfw_append(appfw_signature_buffer, appfw_board_name);
    appfw_append(appfw_signature_buffer, " rev");
    appfw_append(appfw_signature_buffer, appfw_image_revision);

    return appfw_signature_buffer;
}

unsigned int appfw_boot_report(unsigned int stage)
{
    appfw_boot_stage = stage;

    return APPFW_PROTOCOL_REVISION;
}

void SysTick_Handler(void)
{
    HAL_IncTick();

    // 1 Hz blinking
    if ((HAL_GetTick() % 500) == 0)
    {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
    }
}

void initGPIO()
{
    GPIO_InitTypeDef GPIO_Config;

    GPIO_Config.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_Config.Pull = GPIO_NOPULL;
    GPIO_Config.Speed = GPIO_SPEED_FREQ_HIGH;

    GPIO_Config.Pin = LED_PIN;

    LED_PORT_CLK_ENABLE();
    HAL_GPIO_Init(LED_PORT, &GPIO_Config);
}

int main(void)
{
    appfw_boot_report(APPFW_STAGE_BOOT);

    HAL_Init();
    initGPIO();
    // 1kHz ticks
    HAL_SYSTICK_Config(SystemCoreClock / 1000);

    appfw_boot_report(APPFW_STAGE_READY);

    while(1);

    return 0;
}
